"_disableProtectedRuleAlertMessageText" = "You are about to disable a protected rule!";
"_disableProtectedRuleAlertInformativeText" = "Protected rules are essential for smooth system operation. In general it’s therefore not recommended to disable these rules.";

"_exportFailedAlertMessageText" = "The backup file can not be created because you don’t have the necessary permissions for the selected folder.";
"_exportFailedAlertInformativeText" = "Please use Finder to change the permissions for the folder or select a different folder.";

"_importFromBackupInfoAlertMessageText" = "Import from Backup";
"_importFromBackupInfoAlertInformativeText" = "With this import method you can restore your complete Little Snitch settings from a Time Machine backup or a similar backup solution.\n\nTo restore from a Little Snitch 2 backup, select a backup copy of your /Library/Application Support/Objective Development/Little Snitch/rules.xpl file.\n\nTo restore from a Little Snitch 3 backup, select a backup copy of your /Library/Application Support/Objective Development/Little Snitch/configuration.xpl file.\n\nPlease note that the import overwrites all your current rules, profiles and preference settings for all users of this computer.\n\nA copy of your current configuration.xpl file is preserved next to the restored file.\n\nImporting .lsbu files from older versions of Little Snitch is currently not supported.\n";
"_importFromBackupInfoAlertFirstButton" = "Continue with Import";
"_importFromBackupInfoAlertSecondButton" = "Cancel";

"_importFromBackupAuthorizationPrompt" = "The restore from backup changes the rules, profiles and settings for all users of this computer.";

"_importFromBackupFailureMessageText" = "Import from backup failed.";
"_importFromBackupFailureInformativeText" = "The provided backup file could not be read.";

"nonExistentPathToolTipFormat %@" = "The application “%@” doesn’t exist anymore";
"nonProcessPathToolTipFormat %@" = "The object “%@” is neither an application nor a Unix Executable";

"alertMessageCannotSetProfileProtectedRule" = "Cannot add protected rule to profile.";
"alertInfoCannotSetProfileProtectedRule" = "The selection contains a protected rule. Protected rules are essential for smooth system operation, and therefore cannot be modified.\n\nIf you want to override a protected rule anyway, you can disable it.";
"alertMessageCannotRemoveProfileProtectedRule" = "Cannot remove protected rule from profile.";
"alertInfoCannotRemoveProfileProtectedRule" = "The selection contains a protected rule. Protected rules are essential for smooth system operation, and therefore cannot be modified.";
"alertMessageCannotDeleteProtectedRule" = "Cannot delete protected rule.";
"alertInfoCannotDeleteProtectedRule" = "The selection contains a protected rule. Protected rules are essential for smooth system operation, and therefore cannot be deleted.\n\nIf you want to override a protected rule anyway, you can disable it instead.";

"alertMessageCannotSetProfileProtectedRules" = "Cannot add protected rules to profile.";
"alertInfoCannotSetProfileProtectedRules" = "The selection contains protected rules. Protected rules are essential for smooth system operation, and therefore cannot be modified.\n\nIf you want to override a protected rule anyway, you can disable it.";
"alertMessageCannotRemoveProfileProtectedRules" = "Cannot remove protected rules from profile.";
"alertInfoCannotRemoveProfileProtectedRules" = "The selection contains protected rules. Protected rules are essential for smooth system operation, and therefore cannot be modified.";
"alertMessageCannotDeleteProtectedRules" = "Cannot delete protected rules.";
"alertInfoCannotDeleteProtectedRules" = "The selection contains protected rules. Protected rules are essential for smooth system operation, and therefore cannot be deleted.\n\nIf you want to override a protected rule anyway, you can disable it instead.";

"alertMessageCannotSetProfileGlobalRule" = "Cannot add global rule to profile.";
"alertInfoCannotSetProfileGlobalRule" = "The selection contains a global rule. Global rules can only be modified if “Allow Global Rule Editing” is turned on in Preferences → Security.";
"alertMessageCannotRemoveProfileGlobalRule" = "Cannot remove global rule from profile.";
"alertInfoCannotRemoveProfileGlobalRule" = "The selection contains a global rule. Global rules can only be modified if “Allow Global Rule Editing” is turned on in Preferences → Security.";
"alertMessageCannotDeleteGlobalRule" = "Cannot delete global rule.";
"alertInfoCannotDeleteGlobalRule" = "The selection contains a global rule. Global rules can only be deleted if “Allow Global Rule Editing” is turned on in Preferences → Security.";

"alertMessageCannotSetProfileGlobalRules" = "Cannot add global rules to profile.";
"alertInfoCannotSetProfileGlobalRules" = "The selection contains global rules. Global rules can only be modified if “Allow Global Rule Editing” is turned on in Preferences → Security.";
"alertMessageCannotRemoveProfileGlobalRules" = "Cannot remove global rules from profile.";
"alertInfoCannotRemoveProfileGlobalRules" = "The selection contains global rules. Global rules can only be modified if “Allow Global Rule Editing” is turned on in Preferences → Security.";
"alertMessageCannotDeleteGlobalRules" = "Cannot delete global rules.";
"alertInfoCannotDeleteGlobalRules" = "The selection contains global rules. Global rules can only be deleted if “Allow Global Rule Editing” is turned on in Preferences → Security.";

"alertMessageProfileNotFound" = "The profile does not exist anymore.";

"alertMessageSingleRuleNotFound" = "The rule does not exist anymore.";
"alertInfoSingleRuleNotFound" = "It was either deleted, disabled or modified.";
"alertMessageNoRuleFound" = "These rules don’t exist anymore.";
"alertInfoNoRuleFoundFormat %lu" = "All %lu rules were either deleted, disabled or modified.";
"alertMessageOneRuleNotFound" = "One of these rules does not exist anymore.";
"alertInfoOneRuleNotFound" = "It was either deleted, disabled or modified.";
"alertMessageMultipleRulesNotFound" = "Some rules don’t exist anymore.";
"alertInfoMultipleRulesNotFoundFormat %lu" = "%lu rules were either deleted, disabled or modified.";

/* Repair Rules */
"_unableToTepairRuleAlertMessageText" = "Unable to repair rule.";
"_unableToTepairRulesAlertMessageText" = "Unable to repair rules.";
"_couldNotRepairRuleAlertInformativeText" = "The selected rule could not be repaired.";
"_couldNotRepairRuleAlertInformativeTextFormat %lu" = "One of the %lu selected rules could not be repaired.";
"_couldNotRepairRulesAlertInformativeTextFormat %lu %lu" = "%lu of the %lu selected rules could not be repaired.";
"_deleteRuleInsteadAlertInformativeText" = "Do you want to delete this rule instead?";
"_deleteRulesInsteadAlertInformativeText" = "Do you want to delete these rules instead?";

/* Filters */
"SidebarDescription_AllRules" = "The filtering behavior of Little Snitch is defined by the rules listed here.\n\nSee the Little Snitch Help, chapter <help:Rules|lshelp-essentials-rules> for more information.";
"SidebarDescription_Last24Hours" = "This section displays all rules that have been created within the last 24 hours.";
"SidebarDescription_TemporaryRules" = "Temporary rules have a limited lifetime and expire at a certain point in time (e.g. when the corresponding application quits). When the rule expires, it’s automatically converted into a rule suggestion.\n\nSee the Little Snitch Help, chapter <help:Rule Lifetime|lshelp-essentials-rules-lifetime> for more information.";
"SidebarDescription_UnapprovedRules" = "Rules created outside of Little Snitch Configuration (e.g. via Connection Alert) are tagged as unapproved, allowing you to review them later here.\n\nRefer to the individual rule’s notes, or see the Little Snitch Help, chapter <help:Rule Annotations|lshelp-essentials-rules-annotations> for more information.";
"SidebarDescription_GUIApplications" = "This section only shows those rules that are related to applications with a graphical user interface (in contrast to background processes without any windows other graphical interface).";
"SidebarDescription_BackgroundProcesses" = "This section only shows those rules that are related to background processes without any windows or other graphical user interface (in contrast to GUI Applications).";
"SidebarDescription_ProtectedRules" = "Protected rules are part of the factory rule set. They are crucial for the system to work properly and hence cannot be deleted but only disabled.\n\nSee the Little Snitch Help, chapter <help:Rule Annotations|lshelp-essentials-rules-annotations> for more information.";
"SidebarDescription_GlobalRules" = "This section only shows those rules that are not restricted to a particular process owner, but are effective for any user.\n\nSee the Little Snitch Help, chapter <help:Rules|lshelp-essentials-rules> for more information.";
"SidebarDescription_SystemRules" = "This section only shows those rules that are restricted to system processes. Typically, these are system wide services running permanently in background.\n\nSee the Little Snitch Help, chapter <help:Rules|lshelp-essentials-rules> for more information.";
"SidebarDescription_IncomingConnections" = "This section only shows rules for processes that are able to accept incoming connections.\n\nSee the Little Snitch Help, chapter <help:Rules|lshelp-essentials-rules> for more information.";

/* Filter info sheets */
"filterInfoMessage_suggestedAlertTimeout" = "Connection Alert confirmed automatically";
"filterInfoInfo_suggestedAlertTimeout" = "An application tried to establish a connection while you were away. Little Snitch automatically confirmed the connection attempt according to your preferences.";

/* Suggestions */
"SidebarDescription_LoginConnections" = "While no user is logged in or a login is in progress, Little Snitch cannot display Connection Alerts. It therefore creates suggestions for all connection attempts that occur during that time.\n\nSee the Little Snitch Help, chapter <help:Suggestions|lshelp-essentials-suggestions> for more information.";
"SidebarDescription_IncomingConnectionSuggestions" = "Since Little Snitch cannot show a Connection Alert for certain incoming data packets, e.g. in a connectionless protocol such as UDP or ICMP, it automatically denies these packets when there is no matching rule, but creates a rule suggestion for each new set of connection parameters encountered.\n\nSee the Little Snitch Help, chapter <help:Suggestions|lshelp-essentials-suggestions> for more information.";
"SidebarDescription_SilentModeConnections" = "In Silent Mode, instead of showing a Connection Alert, Little Snitch either allows or denies (depending on the type of Silent Mode) all traffic that is not covered by a rule.\n\nSee the Little Snitch Help, chapters <help:Silent Mode|lshelp-connections-silentmode> and <help:Suggestions|lshelp-essentials-suggestions> for more information.";
"SidebarDescription_FullScreenApps" = "When a running application is circumventing the Window Server by using the graphics adapter directly (e.g. a game), Little Snitch is not able to show a Connection Alert. It therefore automatically denies any connection attempt from the full screen application by creating a temporary deny-rule. When the fullscreen application quits, the temporary rule is turned into a suggestion.\n\nSee the Little Snitch Help, chapter <help:Suggestions|lshelp-essentials-suggestions> for more information.";
"SidebarDescription_AlertTimeout" = "Little Snitch can be configured to automatically confirm Connection Alerts after a timeout. Alerts that have been confirmed this way create an “Until Quit” rule, which is converted into a rule suggestion when it expires.\n\nSee the Little Snitch Help, chapters <help:Connection Alert|lshelp-connections-connectionalert> and <help:Suggestions|lshelp-essentials-suggestions> for more information.";
"SidebarDescription_ExpiredTemporaryRules" = "When a temporary rule expires, it is converted into a rule suggestion.\n\nSee the Little Snitch Help, chapters <help:Rule Lifetime|lshelp-essentials-rules-lifetime> and <help:Suggestions|lshelp-essentials-suggestions> for more information.";
"SidebarDescription_InvalidRules" = "These rules are ineffective because the process they refer to has been deleted or moved. You may want to change the rule’s process path or delete the rule.\n\nSee the Little Snitch Help, chapter <help:Suggestions|lshelp-essentials-suggestions> for more information.";
"SidebarDescription_RedundantRules" = "Redundant rules have no effect because they are overruled by another rule with higher precedence. These rules can safely be deleted, unless you plan to delete or disable the overriding rule.\n\n<image:CoveredRule> marks an overridden, and therefore ineffective rule. These rules are redundant and may be deleted.\n<image:CoveringRule> marks an overriding rule, that covers other rules and makes them ineffective.\n\nSee the Little Snitch Help, chapters <help:How rules are matched against connections|lshelp-essentials-rules-matching> and <help:Suggestions|lshelp-essentials-suggestions> for more information.";

/* Profiles */
"SidebarDescription_EffectiveInAllProfiles" = "A profile is a set of rules that is only effective when the corresponding profile is active.\n\nEach rule can be either assigned to one specific profile (and is then only effective when the profile is active), or it’s “effective in all profiles”.\n\nProfiles can also be activated automatically when you switch networks.\n\nSee the Little Snitch Help, chapters <help:Rules|lshelp-essentials-rules>, <help:Profiles|lshelp-essentials-profiles> and <help:Automatic Profile Switching|lshelp-essentials-aps> for more information.";
"SidebarDescription_Profile" = "The rules shown here are only effective when the corresponding profile is active.\n\nProfile-specific rules can override rules that are “effective in all profiles”.\n\nSee the Little Snitch Help, chapters <help:Rules|lshelp-essentials-rules>, <help:Profiles|lshelp-essentials-profiles> and <help:Automatic Profile Switching|lshelp-essentials-aps> for more information.";
